app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE 1=0
---
  def index
    sort = params[:sort]
    case sort
    when 'title'
      @movies = Movie.order('title').all
      @title='hilite'
    when 'releasedate'
      @movies = Movie.order('release_date').all
      @releasedate='hilite'
    when nil
      @movies = Movie.all