app/controllers/movies_controller.rb

  def index
    @all_ratings=Movie.all_ratings
    if params[:ratings]!=nil


        @selected_ratings = params[:ratings]
        @selected_keys=@selected_ratings.keys
    else
          @selected_keys=@all_ratings
    end
    @movies = Movie.where(rating: @selected_keys)

    if params[:sort]!=nil
      sort = params[:sort]
      case sort
      when 'title'
        @movies = Movie.order('title').all
        @title='hilite'
      when 'releasedate'
        @movies = Movie.order('release_date').all
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
SELECT "movies".* FROM "movies"  ORDER BY title
SELECT "movies".* FROM "movies"  ORDER BY release_date

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["rating", "G"], ["release_date", "2015-09-19 00:00:00.000000"], ["created_at", "2015-09-19 17:02:43.412709"], ["updated_at", "2015-09-19 17:02:43.412709"]]

  def update
    @movie = Movie.find params[:id]
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]